glass = ['Шестаков Максим', 'Боженко Мария', 'Шишминцев Дмитрий', 'Затикян Сергей', 'Шаллиева Вера', 'Абдулов Илья', 'Кремпольская Екатерина', 'Надери Мариам', 'Петрова Наталья',
         'Кабдулвахитов Эмир', 'Авокадо Ева', 'Миляев Дмитрий', 'Конопля Алексей']

notglass = ['Бабаев Руслан', 'Смирнов Игорь', 'Касьяненко Вера', 'Язев Григорий', 'Алексеев Тимофей', 'Горлов Игорь', 'Садовая Анастасия', 'Оншин Дмитрий', 'Царев Александр', 'Адрат Олеся',
            'Комелин Глеб', 'Телунц Эдуард', 'Белисов Глеб']

dark_hair = ['Боженко Мария', 'Затикян Сергей', 'Кабдулвахитов Эмир', 'Бабаев Руслан', 'Смирнов Игорь', 'Касьяненко Вера', 'Телунц Эдуард', 'Шестаков Максим', 'Надери Мариам', 'Авокадо Ева',
             'Горлов Игорь', 'Оншин Дмитрий', 'Комелин Глеб']

notdark_hair = ['Шаллиева Вера', 'Кремпольская Екатерина', 'Садовая Анастасия', 'Петрова Наталья', 'Адрат Олеся', 'Шишминцев Дмитрий', 'Абдулов Илья', 'Язев Григорий', 'Алексеев Тимофей',
                'Царев Александр', 'Миляев Дмитрий', 'Белисов Глеб', 'Конопля Алексей']

tushavin = ['Шестаков Максим', 'Боженко Мария', 'Шишминцев Дмитрий', 'Затикян Сергей', 'Шаллиева Вера', 'Касьяненко Вера', 'Язев Григорий', 'Надери Мариам', 'Кабдулвахитов Эмир', 'Комелин Глеб',
          'Белисов Глеб', 'Конопля Алексей', 'Смирнов Игорь', 'Авокадо Ева', 'Царев Александр']

nottushavin = ['Кремпольская Екатерина', 'Садовая Анастасия', 'Петрова Наталья', 'Адрат Олеся', 'Бабаев Руслан', 'Абдулов Илья', 'Алексеев Тимофей', 'Горлов Игорь', 'Оншин Дмитрий', 'Миляев Дмитрий',
               'Телунц Эдуард']

coffee = ['Шестаков Максим', 'Боженко Мария', 'Затикян Сергей', 'Касьяненко Вера', 'Алексеев Тимофей', 'Садовая Анастасия', 'Оншин Дмитрий', 'Кабдулвахитов Эмир', 'Комелин Глеб',
          'Белисов Глеб', 'Миляев Дмитрий']

notcoffee = ['Шаллиева Вера', 'Кремпольская Екатерина', 'Надери Мариам', 'Петрова Наталья', 'Авокадо Ева', 'Адрат Олеся', 'Бабаев Руслан', 'Шишминцев Дмитрий', 'Смирнов Игорь', 'Абдулов Илья',
             'Язев Григорий', 'Горлов Игорь', 'Царев Александр', 'Телунц Эдуард', 'Конопля Алексей']

fullname = ['Абдулов Илья', 'Кремпольская Екатерина', 'Горлов Игорь', 'Садовая Анастасия', 'Кабдулвахитов Эмир', 'Адрат Олеся', 'Телунц Эдуард', 'Конопля Алексей', 'Смирнов Игорь', 'Авокадо Ева',
            'Царев Александр']

notfullname = ['Боженко Мария', 'Шаллиева Вера', 'Касьяненко Вера', 'Надери Мариам', 'Петрова Наталья', 'Бабаев Руслан', 'Шестаков Максим', 'Шишминцев Дмитрий', 'Затикян Сергей',
               'Язев Григорий', 'Алексеев Тимофей', 'Оншин Дмитрий', 'Комелин Глеб', 'Миляев Дмитрий', 'Белисов Глеб']

grow = ['Бабаев Руслан', 'Шестаков Максим', 'Шишминцев Дмитрий', 'Затикян Сергей', 'Абдулов Илья', 'Язев Григорий', 'Алексеев Тимофей', 'Оншин Дмитрий', 'Кабдулвахитов Эмир', 'Адрат Олеся',
        'Телунц Эдуард', 'Конопля Алексей', 'Петрова Наталья', 'Царев Александр', 'Миляев Дмитрий']

notgrow = ['Боженко Мария', 'Шаллиева Вера', 'Кремпольская Екатерина', 'Касьяненко Вера', 'Садовая Анастасия', 'Надери Мариам', 'Авокадо Ева', 'Смирнов Игорь', 'Горлов Игорь', 'Комелин Глеб',
           'Белисов Глеб']

win_spr = ['Бабаев Руслан', 'Шестаков Максим', 'Шишминцев Дмитрий', 'Кремпольская Екатерина', 'Касьяненко Вера', 'Язев Григорий', 'Горлов Игорь', 'Садовая Анастасия', 'Надери Мариам',
           'Оншин Дмитрий', 'Конопля Алексей', 'Петрова Наталья', 'Смирнов Игорь']

notwin_spr = ['Боженко Мария', 'Шаллиева Вера', 'Авокадо Ева', 'Адрат Олеся', 'Затикян Сергей', 'Абдулов Илья', 'Алексеев Тимофей', 'Кабдулвахитов Эмир', 'Царев Александр', 'Комелин Глеб',
              'Миляев Дмитрий', 'Телунц Эдуард', 'Белисов Глеб']

std_dict = {'Очки': glass, 'Не очки': notglass, 'Темные волосы': dark_hair, 'Не темные волосы': notdark_hair, 'Тушавин': tushavin, 'Не Тушавин': nottushavin, 'Кофе': coffee, 'Не кофе': notcoffee,
            'Полное имя с гласной': fullname, 'Полное имя не с гласной': notfullname, 'Выше 175': grow, 'Не выше 175': notgrow, 'Др зимой/весной': win_spr, 'Др не зимой/весной': notwin_spr}
key = []
ans = input('Студент носит очки?')
if ans == 'да':
    key.append('Очки')
else:
    key.append('Не очки')

ans = input('У студента темные волосы?')
if ans == 'да':
    key.append('Темные волосы')
else:
    key.append('Не темные волосы')

ans = input('У студента Тушавин?')
if ans == 'да':
    key.append('Тушавин')
else:
    key.append('Не Тушавин')

ans = input('Студент любит кофе?')
if ans == 'да':
    key.append('Кофе')
else:
    key.append('Не кофе')

ans = input('Полное имя студента начинается с гласной?')
if ans == 'да':
    key.append('Полное имя с гласной')
else:
    key.append('Полное имя не с гласной')

ans = input('Студент выше 175 см?')
if ans == 'да':
    key.append('Выше 175')
else:
    key.append('Не выше 175')

ans = input('Др студента зимой/весной?')
if ans == 'да':
    key.append('Др зимой/весной')
else:
    key.append('Др не зимой/весной')

minlen = 100000000
minlist = []
minkey = ''
for i in range(len(key)):
    if minlen > len(std_dict[key[i]]):
        minlen = len(std_dict[key[i]])
        minlist = std_dict[key[i]]
        minkey = key[i]
print(minlist)
flag = 1
for i in range(len(minlist)):
    for j in range(len(key)):
        if std_dict[key[j]].count(minlist[i]) == 0:
            flag = 0
            break
    if flag == 1:
        if minlist[i] != None:
            print(minlist[i])
        else:
            print('Wrong input!')
    else:
        flag = 1